RIET/src/Catalogs/СтрокиГТД/СтрокиГТД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СтрокиГТД</name>
  <attributes>
    <name>ГТД</name>
    <type>
      <types>DocumentRef.ГТД</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерСтрокиГТД</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеТовара</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесБрутто</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесНетто</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТаможеннаяСтоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>17</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатистическаяСтоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>17</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодТНВЭД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТНВЭД</name>
    <type>
      <types>CatalogRef.TNVEDCodes</types>
    </type>
  </attributes>
  <attributes>
    <name>КодСтраныПроисхождения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДополнительное</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НазваниеЕдиницыИзмеренияДополнительное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодЕдиницыИзмеренияДополнительный</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TemporaryImportDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ПредоставленныеДокументы</name>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Дата</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодВидаДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>5</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИсчислениеПлатежей</name>
    <attributes>
      <name>КодВидаПлатежа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>4</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидПлатежа</name>
      <type>
        <types>CatalogRef.ВидыТаможенныхПлатежей</types>
      </type>
    </attributes>
    <attributes>
      <name>CVC</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПлатежа</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>17</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодВалютыПлатежа</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОсноваНачисления</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>6</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодВалютыОсновыНачисления</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ставка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодТипаСтавки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаКурса</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаСтавки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>2</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

RIET/src/Catalogs/СтрокиГТД/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ПЕРЕД ЗАПИСЬЮ

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ДозаполнитьРеквизиты();
		
	СтруктураРезультатов = ПолучитьСтруктуруРезультатовЗапросовПередЗаписью();
	
	ПроверитьВозможностьИзменения(СтруктураРезультатов, Отказ);		
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ПроверитьЗаполнениеРеквизитов(СтруктураРезультатов, Отказ);
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////

Процедура ДозаполнитьРеквизиты()
	
	РГСофтКлиентСервер.УстановитьЗначение(ОписаниеТовара, СокрЛП(ОписаниеТовара));
	РГСофтКлиентСервер.УстановитьЗначение(Наименование, "" + НомерСтрокиГТД + "-" + ОписаниеТовара);
	
	Для Каждого СтрокаТЧ Из ИсчислениеПлатежей Цикл
		РГСофтКлиентСервер.УстановитьЗначение(СтрокаТЧ.СП, ВРег(СокрЛП(СтрокаТЧ.СП)));
	КонецЦикла;
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////

Функция ПолучитьСтруктуруРезультатовЗапросовПередЗаписью()
	
	СтруктураПараметров = Новый Структура;
	СтруктураТекстов = Новый Структура;
	
	СтруктураПараметров.Вставить("Ссылка", Ссылка);
	
	Если ЗначениеЗаполнено(Ссылка) Тогда
		
		СтруктураТекстов.Вставить("СтарыеРеквизиты",
			"ВЫБРАТЬ
			|	CCDLines.ГТД КАК CCD,
			|	CCDLines.ПометкаУдаления
			|ИЗ
			|	Справочник.СтрокиГТД КАК CCDLines
			|ГДЕ
			|	CCDLines.Ссылка = &Ссылка");
		
	КонецЕсли;
	
	Если НЕ ПометкаУдаления Тогда
		
		Если ЗначениеЗаполнено(ГТД) Тогда
		
			СтруктураПараметров.Вставить("CCD", ГТД);
			СтруктураТекстов.Вставить("РеквизитыCCD",
				"ВЫБРАТЬ
				|	ГТД.Проведен
				|ИЗ
				|	Документ.ГТД КАК ГТД
				|ГДЕ
				|	ГТД.Ссылка = &CCD");
			
			Если ЗначениеЗаполнено(НомерСтрокиГТД) Тогда
				
				СтруктураПараметров.Вставить("НомерСтрокиГТД", НомерСтрокиГТД);
				СтруктураТекстов.Вставить("Дубли",
					"ВЫБРАТЬ
					|	CCDLines.Представление
					|ИЗ
					|	Справочник.СтрокиГТД КАК CCDLines
					|ГДЕ
					|	CCDLines.Ссылка <> &Ссылка
					|	И (НЕ CCDLines.ПометкаУдаления)
					|	И CCDLines.ГТД = &CCD
					|	И CCDLines.НомерСтрокиГТД = &НомерСтрокиГТД");
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
		
	Возврат РГСофт.ПолучитьСтруктуруРезультатовТекстовЗапросов(СтруктураТекстов, СтруктураПараметров);
	
КонецФункции


////////////////////////////////////////////////////////////////////////////////

Процедура ПроверитьВозможностьИзменения(СтруктураРезультатов, Отказ)
	
	Если НЕ ПометкаУдаления И ЗначениеЗаполнено(ГТД) Тогда
		
		ВыборкаРеквизитовCCD = СтруктураРезультатов.РеквизитыCCD.Выбрать();
		ВыборкаРеквизитовCCD.Следующий();
		Если ВыборкаРеквизитовCCD.Проведен = Истина Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				"Нельзя изменять CCD line """ + ЭтотОбъект + """, так как проведена """ + ГТД + """!",
				ЭтотОбъект,,, Отказ);
			Возврат;
		КонецЕсли;
	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Ссылка) Тогда
		
		ВыборкаСтарыхРеквизитов = СтруктураРезультатов.СтарыеРеквизиты.Выбрать();
		ВыборкаСтарыхРеквизитов.Следующий();
		Если НЕ ВыборкаСтарыхРеквизитов.ПометкаУдаления
			И ВыборкаСтарыхРеквизитов.CCD <> ГТД
			И ЗначениеЗаполнено(ВыборкаСтарыхРеквизитов.CCD)
			И ОбщегоНазначения.ПолучитьЗначениеРеквизита(ВыборкаСтарыхРеквизитов.CCD, "Проведен") Тогда
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				"Нельзя изменять CCD line """ + ЭтотОбъект + """, так как проведена """ + ВыборкаСтарыхРеквизитов.CCD + """!",
				ЭтотОбъект,,, Отказ);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////

Процедура ПроверитьЗаполнениеРеквизитов(СтруктураРезультатов, Отказ)
	
	Если ПометкаУдаления Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ГТД) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"""CCD"" is epmty!",
			ЭтотОбъект, "ГТД", , Отказ);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(НомерСтрокиГТД) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"""CCD line no."" is empty!",
			ЭтотОбъект, "НомерСтрокиГТД", , Отказ);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ГТД)
		И ЗначениеЗаполнено(НомерСтрокиГТД) Тогда
		
		Выборка = СтруктураРезультатов.Дубли.Выбрать();
		Пока Выборка.Следующий() Цикл
		
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				"There is already line #" + НомерСтрокиГТД + " for """ + ГТД + """ (""" + Выборка.Представление + """)!",
				ЭтотОбъект, "НомерСтрокиГТД", , Отказ);
			
		КонецЦикла;

	КонецЕсли;
		
КонецПроцедуры
